{"/about":{"title":"About","data":{"":"This site offers a more organized and structured approach to documenting the software development approaches for the Agro-Climatic Advisory Portal - Bicol (ACAP Bicol), initially released as ACAP 1.0 at the end of 2022 and now enhanced to version 2.0 as of 2024."}},"/articles/deployment":{"title":"Deployment","data":{"":"(docs for this section is under construction)"}},"/articles/pdf-development":{"title":"PDF Development","data":{"pdf-bulletin-process-flow#PDF Bulletin Process Flow":"This is the process flow used by ACAP 1.0 for generating bulletin PDFs. Further enhancements or updates may use new processing flows and design, which should be documented here.","development-requirements#Development Requirements":"Yarn\nNote: the project uses the classic stable version v1.22.22\nInstalled with \"npm install -g yarn\"\nGulp\nInstalled during dependencies installation","libraries-used#Libraries Used":"Puppeteer v14.3.0\nEJS v3.1.8","main-flow#Main Flow":"Request bulletin PDF from API endpoint\nBackend (NodeJS)\nFetch data from database\nTransform data\nFeed transformed data to the PDF generator scripts\nRender/upload PDF\nReturn PDF/report","pdf-bulletin-development#PDF Bulletin Development":"The PDF development and technical approach were strongly influenced by the requirements, particularly the need to achieve a 1:1 layout consistency with the complex bulletin images (JPEG), and to contain all text in one (1) PDF page regardless of recommendations content length. This level of precision was challenging to attain using NodeJS-compatible programmable PDF generator libraries like React-pdf, pdfmake or pdfkit.","development-process#Development Process":"","install-dependencies#Install dependencies":"Go to the /server/src/utils/pdf/livereload directory.\nInstall dependencies using yarn, \"yarn install\"","run-the-development-website#Run the development website":"Run \"yarn dev\". Wait for index page to display\nView the sample HTML sites (these translates to the PDF layout design)\ni.e. to view the 10-day HTML:\nClick the URL link: \"10-Day Farm Weather Outlook and Advisory Bulletin\"","adjust-the-html-layout-design#Adjust the HTML layout design":"Create new or update existing vanilla HTML/CSS/JS files\ni.e., for 10-day PDF, edit the file: /utils/pdf/livereload/public/tenday/index.html\nModify the index.html, section-00.css (other CSS), or main.js files to create a simple HTML page that closely matches the reference bulletin image (JPEG).\nNOTE: Ensure that certain text content is placed within <div> elements with fixed width and fixed height to keep everything contained on a single PDF page.\nUse CSS styles for printing\nFor guidance on how text and elements should be resized, refer to the \"adjustText()\" function in the /utils/pdf/livereload/public/tenday/main.js file","update-assets#Update Assets":"Add/delete new assets following the pattern (relative to the current directory, i.e., in /utils/pdf/livereload/public/tenday/)\nCSS/JS files\nPicture files\nUse mid-resolution pictures ideally having small size in KB (kilobytes) but still looks neat in the PDF, to achieve optimized, small-size network-friendly PDF files for downloading\nView the updated HTML page, re-loaded with live reload in the web browser","update-the-ejs-file#Update the EJS file":"Copy + paste updates in the HTML file to its EJS file counterpart\ni.e. for 10-day: /utils/pdf/livereload/templates/pdf-tenday.ejs\nTake note of EJS syntax for new data arrays and variables\nTake note and adjust relative URL links to new or deleted pictures","check-the-bulletin-pdf-script#Check the bulletin PDF script":"i.e., for 10-day PDF: open the file: /utils/pdf/livereload/pdf-tenday.js\nUpdate this file to sync or connect new PDF pictures, CSS, and JS files from the /utils/pdf/livereload/public/tenday/ directory\nNote: The API endpoint script for creating 10-day bulletin calls this script from the controller file /controllers/report/tenday.js","check-the-api-endpoint-controller-script#Check the API endpoint controller script":"i.e., for 10-day: open the file: /server/src/controllers/report/tenday.js\nFetch / query and transform data required by the bulletin PDF script (#6) here\nCheck and review how it uses puppeteer to create a PDF file, combining the EJS file and the vanilla CSS and JS files, returned by the \"tendayTemplatePDF()\" function.","trigger-pdf-preview#Trigger PDF preview":"Trigger PDF preview to view the new PDF layout from the frontend (i.e, Admin - Create 10-Day Bulletin PDF page)\nObserve the rendered PDF preview","additional-notes#Additional Notes":"When creating new bulletin layouts that significantly differ from the existing ones, it's often best to start from scratch with new HTML, CSS, JavaScript, and EJS files. Consider the following guidelines:\nHTML Layout: Ensure the layout matches the reference image (JPEG).\nCSS Styles: Focus on styles optimized for printing and complements the single-page HTML layout.\nJavaScript Functions: Implement functions to control text height dynamically.\nEJS File: Fetch, transform, and render the necessary data\nAssets (Picture Files): Use mid-resolution picture files to optimize the final PDF file size","sample-bulletin-jpeg-layouts#Sample bulletin (JPEG) Layouts":"JPEG Picture References (from R5)\nSeasonal bulletin - | link | mirror | acap-pdf |\n10-day bulletin - | link | mirror | acap-pdf |\nSpecial Weather Forecast bulletin - | link | mirror | acap-pdf |"}},"/checklist":{"title":"Success Checklist","data":{"":"(docs for this section is under construction)Visit this link for more information:\r\nhttps://acaptutorials.github.io/assets-cms/posts/post/?id=83Nc7KofhEU91LJOOtQd"}},"/directories":{"title":"Project Folder Structure","data":{"":"The project repository is a monorepo, with frontend code in the client directory and the backend code in the server directory.\nOther directories within the monorepo include:\ndocs - Contains the latest software development project planning documentation\nscripts - Has bash scripts for various tasks\n.github - Contains GitHub Actions workflows .yml files for deployment to the development and production environments, and for running certain NPM scripts as cron jobs in GitHub Actions Scheduled Workflows.\nCode repository directory structure"}},"/directories/client":{"title":"Client","data":{"":"The client directory contains codes and configurations/settings for the (React) NextJS frontend and Firebase. The folder tree displays the relevant files and folders.The NextJS frontend uses the pages router, since this is suitable for generating static pages to host on GitHub Pages. It uses the \"container-component\" as a dominant pattern, distinguising between logic (container) and UI (component).\nThis documentation only contains information about relevant files and directories within the client directory. For more information about NextJS-specific files and configurations (such as the next.config.js, _app.js, or document.js files), please head over to the NextJS documentation for Pages Router.\nDevelopers should take care not to \"bake\" or \"build\" sensitive data and information into the frontend build during the NextJS static build time with \"next export\" as part of Security - Sensitive Data Management.","files#Files":".env.example - example keys and values to put in the .env file\n.firebaserc - Firebase configuration file\nfirebase.json - Firebase configuration file\nfirestore.rules - Firestore Rules definitions to publish in a Firebase project's Firestore Rules settings\nstorage.rules - Firebase Storage Rules definitions to publish in a Firebase project's Storage settings\nDockerfile.acap - multi-stage build Dockerfile definition for running the client on localhost development or as \"built\" static files for production deployment running on nginx.","folders#Folders":"","pages#/pages":"Components here serves as the \"container\" components in the container-component pattern, mmostly component logic\nex: \"pages/admin\", \"pages/admin/reports\",\r\n\"pages/bulletins\", \"pages/home\"","components#/components":"Components defined here serves as the \"UI\" counterpart of each \"page\" in the container components\nThey can contain nested UI components\nex: \"components/admin\", \"components/admin/reports\",\r\ncomponents/bulletins\", \"components/home\"","componentscommonui#/components/common/ui":"Common UI used everywhere\nex: loading spinners, modal, snackbar, skeleton loaders, fileuploader","componentslayout#/components/layout":"UI for massive page-wide layouting","componentsentities#/components/entities":"(main) UI with processing functions\nex: login, searchbar, auth hoc","domain#/domain":"UI subcomponents of main UI/features stored in the /components or /pages directory","srchooks#/src/hooks":"Custom hooks used for main objects","srcservices#/src/services":"Firebase API calls for main objects\nex: reports, bulletins, provinces, atbp","srcstore#/src/store":"Redux (toolkit) stores and slices\nUsed for tracking and passing heavy-weight main objects data\nex: reports, recommendations, municipalities","file-tree#File Tree":""}},"/directories/server":{"title":"Server","data":{"":"The server directory contains backend JavaScript (NodeJS/Express) codes for running and managing ACAP's REST APIs.ACAP promotes using REST APIs running on the backend to securely perform mutative \"WRITE\" operations in the Firestore database to allow the creation of more robust server-side input validation scripts for simple to complex input data than relying alone on limited Firestore Rules for access checks and data validation.Maintaining a separate backend for securely performing database WRITE operations also syncs with ACAP's requirements to host its frontend UI in GitHub Pages while having access to a secure, remote backend protected by established Security guidelines and adhering to best practices in enforcing web security to maintain sensitive data protection and integrity.\nWhile using the Firestore WEB APIs \"directly\" instead of going through the backend is also an alternate option, developers should be aware of possible security attack vectors that could open up and how to counter them by having a thorough understanding of how the Firebase Authentication, Firebase Custom Claims and Firestore Rules work in sync to keep sensitive user information safe and secure.\nOne of the key things to note here is that using the serverless Firestore WEB APIs to manage data \"directly\" in the Firestore database through the frontend UI with client-side validation logic, where we install its JavaScript APIs, also enables the Firestore REST APIs along with it, which is accessible on other clients, such as a browser console, or Postman, outside the \"safety\" confines of the frontend UI.Knowing that there are two (2) points of data entry to anticipate should enable developers to make informed decisions about when to use the Firestore WEB APIs (preferably with fool-proof Firestore Rules) directly or if they need to delegate operations in a more secure environment, such as the backend server.","files#Files":".env - Dotenv: NodeJS library that loads configuration files from a .env file\n.env.example - example keys and values to put in the server .env file\nDockerfile.acap - multi-stage build Dockerfile definition for running the server on localhost development with livereload using the nodemon library, or built to run for production deployment without livereload\nDockerfile - Used for running the server production deployment on Render\npackage.json / package-lock.json - Contains definitions of the server's NodeJS dependency libraries\n/src/index.js - server program entry point","folders#Folders":"","api#/api":"Contains the index.js file that converts the stand-alone Express app into a single serverless function format recognized by Vercel.\nThis option only becomes available if deployment to Vercel is activated.","express-server-folder#Express server (Folder)":"","middleware#/middleware":"contains scripts that handles Cross-Origin Requests (CORS), router-level data validation and user authentication","controllersindexjs#/controllers/index.js":"contains routing scripts that associates URLs with controller actions","controllers#/controllers":"contains scripts that handles requests, mapping them to target models (classes) and returns success or error responses\nThese sripts, along with the /middleware and /models make up the REST APIs.","models-classes#/models (classes)":"provides methods, organized into categories (classes) for interacting with the database","scripts-folder#/scripts (Folder)":"The scripts directory contains a large collection of Node Package Manager (NPM) scripts used for data processing, uploading and cleanup functions. More information about these scripts are available in the /server/README.md file's Available Scripts - server section.","scriptscron#/scripts/cron":"contains NPM scripts that run as cron jobs in GitHub Actions Scheduled Workflows","scriptsdata#/scripts/data":"contains sample data files in JSON, CSV and EXCEL formats for reference on established data structures and formatting","scriptsseeders#/scripts/seeders":"contains NPM scripts for initializing the Firestore database with default data","scriptsuploaders#/scripts/uploaders":"contains NPM scripts for facilitating raw data file uploads to the Firestore database","scriptsgenerate-docs#/scripts/generate-docs":"contains scripts for generating ACAP's REST API documentation","scriptstools#/scripts/tools":"contains functions for archiving and deleting old PAGASA weather forecast data","utils-folder#/utils (Folder)":"contains various utility helper functions i.e., for date, processing strings, and others","utilspdf#/utils/pdf":"contains scripts that manages the bulletin PDF layouts for seasonal, 10-day and special bulletins","file-tree#File Tree":"This tree shows only the relevant server files and directories."}},"/":{"title":"Welcome to ACAP Tutorials","data":{"":"This site offers a more organized and structured approach to documenting the software development approaches for the Agro-Climatic Advisory Portal - Bicol (ACAP Bicol), initially released as ACAP 1.0 at the end of 2022 and now enhanced to version 2.0 as of 2024.This documentation website is a revamped version of the previous documentation websites, offering informative new sections such as Post-Installation, containing after-initial installation notes and checklists, more details on Security guidelines, and other development-related details.","previous-tutorials-websites#Previous Tutorials Websites":"ACAP 2.0 (latest ACAP Bicol) \nhttps://acaptutorials.github.io/assets-cms/posts/post/?id=cFgd8nBjkdZ6gNNkktGEACAP 1.0 \nhttps://acaptutorials.github.io/assets-cms/posts/post/?id=Teo2m6os7LZtsEi0nGWw"}},"/installation":{"title":"Installation and Setup","data":{"introduction#Introduction":"These series of tutorials describe how to run ACAP-Bicol (ACAP version 2.0) on localhost, using values for a new Region, using the initial ACAP 2.0 release version v10.1.0-alpha.1, dev branch @commit 5c92235b.Fork the repository to receive the latest updates and bug fixes. Configure the following components in order to run ACAP for in your PC or laptap for localhost development.\nTo make the most of these tutorials, please create Firebase projects first as instructed from the 03 Create Firebase Projects video tutorial before proceeding.\nacap-v2 has updated source codes at Release tag  dev branch @commit .","post-installation#Post-Installation":"After installing ACAP, some additional setup is required. This includes configuring the web map on the Home Page, updating static PDF content, and replacing the OpenGraph thumbnails.For detailed instructions on these steps, refer to the Post-Installation section after completing the Installation process.","repository-syncing-options#Repository Syncing Options":"If you are working on a forked repositoy that is behind several updates, you can get the latest updates or bug fixes from the parent acap-v2 repository using any of the options:\n\"Sync\" to the parent repository\nCreate a Pull Request (PR) from the parent repository (acap-v2) to your forked repository, then merge/resolve conflicts.\nPick only the target updates/fixes, then commit them to your fork\nProject Maintainers occasionally updates the parent repository acap-v2 for maintenance, bug fixes and minor/optional updates. Sometimes, introducing massive new feature updates.Of the three (3) repository syncing options mentioned, doing the first or second options ensures up to date sync with the latest updates and bug fixes."}},"/installation/accounts":{"title":"E. Accounts","data":{"":"Create ACAP admin accounts to use for testing. You may create other accounts later for RFO's to use with signing-in to ACAP's admin dashboard. The following methods require a successfully running ACAP client + server app, carrying on from IV. Integration.","login-as-superadmin#Login as Superadmin":"Login as a superadmin to create an admin account. Open a new browser tab to:\nhttp://localhost:3000/superadmin\nLogin using the superadmin login credentials:\nusername: superadmin@gmail.com\r\np/w: -\nUse the random password from the Server Setup step. If yop didn't change it, see the default acap superadmin password in the (server/src/scripts/seeders/00_superadmin/index.js) file for reference.","create-a-new-admin-account#Create a new Admin account":"Press the CREATE USER button.\nFollow the UI input prompts for creating a new Admin account.","sign-in-using-the-admin-account#Sign-in using the Admin account":"Sign-out from the superadmin account.\nOpen the browser to:\nhttp://localhost:3000/admin\nUse the Admin account created in step #2 to sign-in"}},"/installation/client-setup":{"title":"C. Client Setup","data":{"":"Please read the client's README file in /client/README.md as reference for more information on the client environment variables.\nThe 09 Client setup for localhost development video tutorial shows how to initialize the server for localhost development in more detail.","setup-environment-variables#Setup environment variables":"Update the client .env file, copying the keys and values from the .env.example file. You can leave the default values for now, but be sure to update the following with new values:\nThe client REGION_NAME should be similar with the server REGION_NAME value.\nREGION_NAME\nDEFAULT_PROVINCE\nDEFAULT_MUNICIPALITY // --> Any municipality under the DEFAULT_PROVINCE\nNEXT_PUBLIC_FIREBASE_WEB_API_KEY\nNEXT_PUBLIC_FIREBASE_WEB_AUTHDOMAIN\nNEXT_PUBLIC_FIREBASE_WEB_PROJECT_ID\nNEXT_PUBLIC_FIREBASE_WEB_STORAGE_BUCKET\nNEXT_PUBLIC_FIREBASE_WEB_MESSAGING_SENDER_ID\nNEXT_PUBLIC_FIREBASE_WEB_APP_ID\nNEXT_PUBLIC_FIREBASE_WEB_MEASUREMENT_ID\nREGION_CODE\nREGION_LAT_AND_LNG\nREGIONAL_FIELD_OFFICE\nREGION_URL\nCROPPING_CALENDAR_RICE_EXCEL_FILE\nCROPPING_CALENDAR_CORN_EXCEL_FILE\nRECOMMENDATIONS_RICE_EXCEL_FILE\nRECOMMENDATIONS_CORN_EXCEL_FILE","copy-template-files#Copy template files":"Create a directory named \"files\" under the /client/public directory: \"/client/public/files\".\nCopy the Excel files from the \"/server/src/scripts/data/dataset_v2.0\" directory to the \"files\" directory\nCopy the the /server/src/scripts/data/pagasa_seasonal_v2.xlsx Excel file to the \"files\" directory\nUse the \"files\" directory and its contents on localhost development but not push it to the repository.","update-environment-variables-after-deployment#Update environment variables after deployment":"Certain client environment variables, such as URLs (i.e., BASE_URL_PROD) will become available after deployment. Update the rest of the .env variables later after:\nSetting-up and deploying the (development and production) servers respectively to their own Render.com cloud services\nDeploying the development website to Firebase Hosting\nDeploying the production website to GitHub Pages"}},"/installation/conclusion":{"title":"F. Conclusion","data":{"":"ACAP-Bicol will display values for the region, provinces and municipalities defined in the client and server's .env file. Browse through the running (localhost) ACAP website pages to check if the new provinces and municipalities are displaying.Visit the  ACAP 1.0 Duplication Checklist post and checkout the following sections to confirm the localhost website pages. (Some items in the checklist are not yet applicable until relevant data are provided and updated).\nPublic Pages\nSuperadmin Pages\nAdmin Crop Recommendation Pages\nAdmin SMS Management Pages\nAdmin Profile\nAdmin ACAP Settings\nSecurity\nCongratulations! Now, you are ready to proceed with the Post-Installation Setup."}},"/installation/firebase":{"title":"A. Firebase Initialization","data":{"checkout-the-latest-acap-20-source-codes#Checkout the latest ACAP 2.0 source codes":"Fork the latest repository to get the latest updates and bug fixes, if you haven't already done so.Read about the latest repository version and forking notes in the Installation and Setup section for more information.","create-a-new-firebase-project-for-the-new-region#Create a new Firebase Project for the new Region":"Create a new Firebase project for the development environment of the new region. Follow the steps in the 03 Create Firebase Projects video tutorial for more information.","initialize-the-firebase-storage#Initialize the Firebase Storage":"Copy the contents of the /client/storage.rules file to the Rules tab\nSet the Firebase Storage's Cross Origin Resource Sharing (CORS) permissions using the Google Cloud Shell.\nGo to your Firebase project’s google cloud console on https://console.cloud.google.com/home.\nActivate the cloud shell by clicking the Activate Cloud Shell button on the upper right menu.\nCreate a cors.json file on the cloud shell using any of it's cloud-based text editors. Copy and paste the following contents to the JSON file:\n[\n  {\n      \"origin\": [\"*\"],\n      \"method\": [\"GET\"],\n      \"maxAgeSeconds\": 3600\n    }\n]\nRun the command on cloud shell. Replace BUCKET_NAME with your Firebase Storage bucket name.\ngsutil cors set cors.json gs://<FIREBASE_PROJECT_ID>.appspot.com\nView the current cors configuration of a bucket:\ngsutil cors get gs://<FIREBASE_PROJECT_ID>.appspot.com","initialize-the-firestore-database#Initialize the Firestore Database":"Copy the contents of the /client/firestore.rules file to the Firestore Rules tab","initialize-the-firebase-authentication#Initialize the Firebase Authentication":"Enable Email/Password Authentication"}},"/installation/integration":{"title":"D. Integration","data":{"":"This section requires a successful set-up of the Client and Server to proceed.","using-nodejs#Using NodeJS":"Do the following steps to run the client and server apps when using NodeJS for local development.","run-the-client-app#Run the client app":"Navigate to the client app using the commandline then run the script:\ncd client\r\nnpm run dev","run-the-server-app#Run the server app":"Navigate to the server app using the commandline then run the script:\ncd server\r\nnpm run dev","load-the-acap-website#Load the ACAP website":"Open a web browser and navigate to this local site to load the ACAP website on localhost:\nhttp://localhost:3000","using-docker#Using Docker":"ACAP uses Docker to run the production server app in Render, using the server Dockerfile. You can use this, or the Dockerfile.acap files in the /server directory to run the server app in production mode.\nDo the following steps when using Docker for localhost development. Navigate to the project's root directory then:","build-images#Build images":"Build the client and server containers for localhost development.\ndocker compose -f docker-compose.dev.yml build","run-containers#Run containers":"Create and start the development client and server containers.\ndocker compose -f docker-compose.dev.yml up","stop-containers#Stop containers":"Stop and remove the development containers, networks, images and volumes\ndocker compose -f docker-compose.dev.yml down","load-the-acap-website-1#Load the ACAP website":"Open a web browser and navigate to this local site to load the ACAP website on localhost:\nhttp://localhost:3000"}},"/installation/server-setup":{"title":"B. Server Setup","data":{"":"Please read the server's README file in /server/README.md as reference for more information on the server environment variables.\nThe 08 Server Setup for Localhost Development video tutorial shows how to initialize the server for localhost development in more detail.","setup-environment-variables#Setup environment variables":"Create a .env file inside the /server directory. Copy the contents of the .env.example file in it.\nReplace the FIREBASE_SERVICE_ACC variable with the Firebase project's private key from it's service account JSON file.\nReplace the FIREBASE_PRIVATE_KEY variable with the FIREBASE_SERVICE_ACC's private_key entry.\nReplace the FIREBASE_STORAGE_BUCKET variable with your Firebase project's storage bucket\nReplace the REGION_NAME variable with a string (no white space) representing the name of your new target region\nThe server REGION_NAME should be similar with the client REGION_NAME value.\nSet AXIOS_SSL_REJECT_INVALID to 0\nIf AXIOS_SSL_REJECT_INVALID does not yet exist, please make sure that your forked repository have the most recent update from the upstream repository.\nThe AXIOS_SSL_REJECT_INVALID variable was added recently in ACAP-Bicol 1.0 v9.3.13 to fix a new bug that fails web scraping PAGASA's tropical cyclone and El Nino / La Nina web pages.\nInitially set CHECK_RANGE_YEAR to 0.\nThis variable validates that the 10-day PAGASA Excel files downloads contain the latest year.\nRunning the npm run seed:all script below will throw an error if this variable set to 1, since the sample local 10-day PAGASA Excel files used for seeding initial data have outdated dates\nSet it back to CHECK_RANGE_YEAR=1 after running the seed:all script.\nSet SPECIAL_CHARACTERS to ├â┬▒:ñ,â:\nThis variable converts the ├â┬▒ garbled text to ñ from municipality names containing the ñ character in the PAGASA 10-day weather forecast Excel files.\nAdd other key-value pairs of special characters and their normalized values, delimited by a comma as needed\nRead on this reference for more information about this bug.\nACAP 2.0 introduces several new environment variables. Add the following, while refering to the server's README file in /server/README.md for more information about these variables. Some variables need to be added or excluded in order to enable or disable the ACAP-RCMAS APIs.\nSPECIAL_CHARACTERS\nDEPLOYMENT_PLATFORM=default\nPROVINCES_ARCHIVE - Set its value after running 2. Initialize provinces and municipalities\nACAP_API_KEYS\nIS_RMCAS_API_ACTIVE=0\nROOT_API_URL\nROOT_API_URL_VERCEL\nCHECK_RANGE_YEAR","initialize-provinces-and-municipalities#Initialize provinces and municipalities":"Run ACAP's \"pagasa:municipalities\" NPM script to get a list of the latest  PAGASA-updated municipalities and province names.\nFirst navigate to the server directory from the command line then run:\nnpm run pagasa:municipalities\nEnter PAGASA's 10-day excel file URL when prompted.\nThese files, updated daily around 8:00 AM are available on https://www.pagasa.dost.gov.ph/climate/climate-prediction/10-day-climate-forecast\nEnter a specific PAGASA's 10-day excel file URL when prompted:\nhttps://pubfiles.pagasa.dost.gov.ph/pagasaweb/files/climate/tendayweatheroutlook/day1.xlsx\nReplace the PROVINCES and PROVINCES_ARCHIVE variables with the comma-separated province names of your new target region resulting from step #2.\nReplace the DEFAULT_PROVINCE .env variable with any province name from the PROVINCES comma-separated province names.","create-new-superadmin-password#Create new superadmin password":"Open the the file: /server/src/scripts/seeders/00_superadmin/index.js\nAdd a password parameter to the params object. Enter a random password, and remember its value.\nconst params = {\n  ...,\n  displayname: 'Super Admin',\n  account_level: 1,\n  password: 'some_super_secret_password'\n}","seed-default-data#Seed default data":"This script initializes the Firestore database with default values. Navigate to the server folder from the command line and run the NPM script:\nnpm run seed:all\nThis script will create default, mock (empty) values to designated Firestore collections and documents using the defined region and provinces in the .env file, which should be updated later with real values.\nThis script expects to finish without errors. Re-trace, debug and troubleshoot errors, if any will show, before proceeding to the Client Set-up section.","initialize-10-day-weather-forecast#Initialize 10-day weather forecast":"Run this server NPM script to fetch and upload the @latest PAGASA 10-day weather forecast data to the Firestore database. Navigate to the server folder from the command line and run the NPM script:\nnpm run cron:tenday","build-the-api-docs-optional#Build the API docs (Optional)":"(Optional) Build ACAP server's REST API documentation website for reference.\nNavigate to the server folder from the command line and run the NPM script:\nnpm run gen:docs\nGo to the /server/src/public/docs folder and click the index.html file to view the generated API documentation.\nThe API documentation website is also available on http://localhost:3001/docs after running the server app."}},"/post-installation":{"title":"Post-Installation","data":{"":"These tutorials contain additional post-installation instructions after initially setting up the client and server apps on the Installation section.","immediate#Immediate":"","others#Others":""}},"/post-installation/acap-rcmas-api":{"title":"ACAP-RCMAS REST APIs","data":{"":"The ACAP-RCMAS REST APIs, aiming to share ACAP's internal PAGASA weather forecast data in a structured, organized format and secure manner to collaborators, are a new addition to ACAP's REST APIs.These APIs, accessible in the /api/weatherforecast and /api/weatherforecast/archives REST API endpoints, provide several GET query methods for retrieving seasonal, 10-day, and severe cyclone weather forecasts. Furthermore, its inclusion in ACAP allowed the archiving of historical weather forecast data, also available by query in these API endpoints.These APIs are in their prototype stage, currently for use only by the Bicol region for sharing weather forecast data with IRRI as part of their collaboration project. \nRegions outside Bicol are to prevent these APIs and their respective archiving and deletion functions from running and being accessible until further notice by the DA. They can also opt to start testing using it earlier.\nTo prevent the ACAP-RCMAS REST API and functions from running, please supply the \"disabled\" values of its server .env file, GitHub Actions Secrets/Variables, and Render Secrets/Variables described in the acap-v2's root and server README files."}},"/post-installation/cropping-calendar":{"title":"Cropping Calendar","data":{"":"ACAP uses crop stage data from  cropping calendars, following established formats as input parameters for generating crop recommendations.This section details guides on updating ACAP's cropping calendar(s) for the latest ACAP 2.0 version. It also discusses cropping calendar updating methods for the older ACAP 1.0 for backtracking purposes."}},"/post-installation/cropping-calendar/calendar-v2":{"title":"ACAP 2.0 Cropping Calendar","data":{"introduction#Introduction":"This section describes methods for uploading cropping calendars for the latest ACAP 2.0, whose latest stable version is Release/Tag version , accessible in the acap-v2 repository.Follow this link to view cropping calendar upload instructions for the older ACAP 1.0.","data-format#Data Format":"ACAP 2.0 uses cropping calendars with two (2) groups of crop stages supporting one (1) or more types of crops. View its raw EXCEL data files in the /server/src/scripts/data/dataset_v2.0 directory for more information about its contents and data structure.","crop-stage-codes-and-labels#Crop Stage Codes and Labels":"This section only displays the ACAP 2.0 crop stage codes and labels for the Rice and Corn crops.\nThe crop stage codes should match those defined in the ACAP 2.0 crop recommendations raw Excel files crop stages specific to target crops to ensure the correct association of crop stages with target recommendations.\nSupport for Multiple Crops \nDevelopers can add crop stages and labels for other crops, following the crop stages code and label format in the /client/src/utils/constants.js file and by creating cropping calendars similar to the sample cropping calendar Excel files described in the Data Format section as a reference.","rice#Rice":"Crop Stage Code\tCrop Stage Label\tprep\tPreparation Stage\tseed\tSeedling Stage\tplant\tNewly Planted\tvegat\tVegetative (Active Tillering)\tvegpi\tReproductive (Panicle Initiation)\trepro\tReproductive (Flowering)\tmat\tMaturing","corn#Corn":"Crop Stage Code\tCrop Stage Label\tprep\tPreparation Stage\tseed\tSeedling Stage\tvegleaf\tVegetative (Leaf Stages)\tvegtass\tVegetative (Tasseling)\trepro\tReproductive\tmat\tMaturing","upload-crop-calendar-data#Upload Crop Calendar Data":"ACAP 2.0 uploads its cropping calendars using an upload form on the Cropping Calendars page, requiring Admin login.\nThe crop stage codes should match the crop stage codes defined in the crop recommendations raw Excel files specific to target crops to ensure the correct association of crop stages with target recommendations.","prepare-the-frontend--backend#Prepare the frontend / backend":"Update the frontend and backend codes with necessary data for supporting other crops, with data formats described in the Data Format and Crop Stage Codes and Labels section.","login-as-admin#Login as Admin":"Login as an ACAP admin, then, navigate to the Cropping Calendar Management page in the /admin/cropping-calendars route.","upload-cropping-calendars#Upload Cropping Calendars":"Upload Cropping Calendar: Select a \"Crop Type\" from the available crops list and select options.\nUpload an Excel file: Press the SEARCH icon.\nBrowse for a cropping calendar that corresponds to the selected Crop Type in step #1.\nPress the UPLOAD button.\nWait for the upload success or fail status response to appear."}},"/post-installation/cropping-calendar/calendar-v1":{"title":"ACAP 1.0 Cropping Calendar","data":{"introduction#Introduction":"This section describes methods for uploading the cropping calendar for the older ACAP 1.0. Its last stable version is Release/Tag version 9.5.6, accessible in the climate-services-webportal-v1 and acap-v2 code repositories.Follow this link to view cropping calendar upload instructions for the latest ACAP 2.0.","data-format#Data Format":"ACAP 1.0 uses a cropping calendar with only one (1) group of crop stages, supporting only one (1) type of crop (Rice). View its raw CSV data file in the /server/src/scripts/data/cropping_calendar_v2.csv file for more information about its contents and data structure.","crop-stage-codes-and-labels#Crop Stage Codes and Labels":"The crop stage codes should match with the crop stage codes defined in the ACAP 1.0 crop recommendations raw Excel file to ensure the correct association of crop stages with target recommendations.\nCrop Stage Code\tCrop Stage Label\tlprep\tPreparation Stage\tplant/trans\tNewly Planted\tveg/repro\tVegetative/Reproductive\tmat\tMaturing","upload-crop-calendar-data#Upload Crop Calendar Data":"ACAP 1.0 uploads its cropping calendar data to the Firestore database using NPM scripts, accessible only to developers.","prepare-cropping-calendar-data#Prepare cropping calendar data":"Prepare the necessary cropping calendar data for a region, following the format from the /server/src/scripts/data/cropping_calendar_v2.csv CSV file.\nTake note of the municipality names, which should sync with the PAGASA 10-day weather forecast naming conventions to ensure smooth data processing.\nPut the CSV file in the /server/src/scripts/uploaders/cropping_calendar directory.","use-a-target-environment#Use a target environment":"Open the server .env file. Update the FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY keys with the development or production key values.","run-the-npm-script#Run the NPM Script":"Navigate to the /server directory from a terminal.\nRun the command, replacing cropping_calendar_v2.csv with the filename of a cropping calendar CSV file:\nnpm run upload:calendar --localfilename=cropping_calendar_v2.csv\nEnsure running the script from step #3 is completed successfully.","scripts#Scripts":"","crop-calendar-generator#crop-calendar-generator":"External tool that generates random cropping calendar data for the municipalities of a selected region.\nAvailable at link"}},"/post-installation/google-search":{"title":"SEO with Google Search Console","data":{"":"Google Search Console helps with Search Engine Optimization (SEO), helping websites become discoverable in search engines like Google, Bing or Yahoo Search, along with other factors and best practices for achieving good SEO performance.\nNote however, that Google Search Console alone won't drive up a website's SEO ranking. Visibility and popularity in search engines also depends on other SEO best practices, such as writing semantic, meaningful content on each page and building external links from external sources like social media, among others.\nThis is an optional update for ACAP introduced in its 2.0 version, should developers want to slightly increase their ACAP's rank and visibility in the Google Search results.\nThis requires the latest updates from the acap-v2 repository at release v10.1.0-alpha.6, dev branch commit @e2df7bf or later.","requirements#Requirements":"ACAP website running in its production GitHub Pages i.e.,https://acap-bicol.github.io\nGoogle Account","register-with-google-search-console#Register with Google Search Console":"","login-to-google#Login to Google":"Login to a Google account.","register-site-to-google-search-console#Register Site to Google Search Console":"Navigate to the Google Search Console website registration page.\nSelect the URL prefix option. Enter the root domain name of the ACAP website. For example, https://acap-bicol.github.io.\r\nPress the CONTINUE button.\nDownload the HTML file in the resulting Verify ownership window. For example, the HTML file's name is \"google9e24fb24f7c185b4.html\"","upload-html-verification-file#Upload HTML Verification File":"Put the \"google9e24fb24f7c185b4.html\" file under the /client/config directory.\nCommit and push the file to the forked repository.\nDeploy the ACAP website to the production GitHub Pages website to upload the verification file.\nThe \"google9e24fb24f7c185b4.html\" should become available from the production website's root URL after a successful deploy.\nFor reference, the ACAP-Bicol's google verification file is available at: https://acap-bicol.github.io/google9e24fb24f7c185b4.html","authenticate-the-html-verification-file#Authenticate the HTML Verification File":"Press the AUTHENTICATE button in the Verify ownership window after uploading the HTML verification file in the production website's root URL.\nIn case you have closed the window, search for the registered URL in the upper left \"Search for property\" search bar.\nSteps #1 or #2 should authenticate the HTML verification file, if its successfully uploaded to the website's root directory.","submit-a-sitemap#Submit a Sitemap":"A sitemap.txt file should be available in the ACAP production GitHub Pages website if it was deployed with the latest updates from the acap-v2 repository at release v10.1.0-alpha.6, dev branch commit @e2df7bf or later.\nClick the Sitemaps tab in the Google Search Console dashboard.\nEnter the ACAP's sitemap URL in its input prompt for example:\nhttps://<REGION_N_ACAP>.github.io/sitemap.txt\nSubmit the sitemap.\nWait for several days to up 1 - 2 weeks after a successful submission for the sitemap pages to become indexed and to receive feedback in the Google Search Console dashbboard - Overview, Pages, Performace, and others.\r\nWhile waiting, observe and resolve errors that the Google Search Console may display in the dashboard - Pages tab.\nAfter a few days up to several weeks after a successful page indexing, search for your website in Google Search and observe if it will be among the top search results."}},"/post-installation/opengraph":{"title":"Opengraph Settings","data":{"":"OpenGraph is a protocol used by websites to control how their content is displayed when shared on social media platforms and messaging apps.This section contains notes on updating the thumbnail-like images that appears when sharing the ACAP website URLs in social media like Meta and Twitter.\nACAP only display OpenGraph images on its production website hosted at (GitHub Pages) https://acap-bicol.github.io to differentiate between the development and production websites.","opengraph--meta-description#OpenGraph / Meta Description":"Open the /server/src/scripts/data/assets_dev.csv file.\nSelect the row whose filename column is equals to \"og_home\".\nReplace all \"Bicol\" text with the new region name in it's description column.","opengraph-thumbnails#OpenGraph Thumbnails":"","create-new-opengraph-images#Create New OpenGraph Images":"Take note of ACAP's public pages. These are pages which do not require login.\nHome Page - / (index page)\nACAP Services - /weather-services\nCropping Calendar - /cropping-calendar-v2\nSeasonal / 10-Day Recommendations - /agroclimatic-services\nBulletins PDF Download - /bulletins\nSesaonal Bulletins PDF Download - /bulletins/seasonal-outlook\n10-Day Bulletins PDF Download - /bulletins/weather\nSpecial Bulletins PDF Download - /special-weather-forecast\nAdmin Login - /admin/login\nSuperadmin Login - /superadmin/login\nCreate 1200 x 600 pixel picture banners for each of the public pages mentioned in step #1.\n(Optional) For reference, you can use ACAP's opengraph Photoshop PSD template to create new OpenGraph images. Press the (left) DOWNLOAD button to download the file.\nA total of ten (10) new thumbnail files should be created, continuing from step #2. Let us use region 6 for example. Press the (left) DOWNLOAD button to download and view the picture files.","upload-the-opengraph-images#Upload the OpenGraph Images":"Upload the ten (10) new OpenGraph to an online storage or hosting site. Their online URL should be publicly accessible after upload.\nACAP uploaded its OpenGraph images in Firebase Storage.\nTake note of the images' online URL after upload.","replace-the-opengraph-urls#Replace the OpenGraph URLs":"Open the /server/src/scripts/data/assets_dev.csv file.\nReplace the url column of the rows with column page = \"og\" and whose filename column starts with \"og_\" with the new OpenGraph image URLs from Upload the OpenGraph Images - step #2\nfilename\tpage name\tpublic page route\tog_home\tHome Page\t/\tog_services\tACAP Services\t/weather-services\tog_calendar\tCropping Calendar\t/cropping-calendar-v2\tog_recommendations\tSeasonal / 10-Day Recommendations\t/agroclimatic-services\tog_bulletins\tBulletins PDF Download\t/bulletins\tog_bulletins_10day\t10-Day Bulletins PDF Download\t/bulletins/weather\tog_bulletins_seasonal\tSesaonal Bulletins PDF Download\t/bulletins/seasonal-outlook\tog_bulletins_typhoon\tSpecial Bulletins PDF Download\t/special-weather-forecast\tog_admin\tAdmin Login\t/admin/login\tog_superadmin\tSuperadmin Login\t/superadmin/login","upload-the-new-opengraph-urls#Upload the New OpenGraph URLs":"Upload the new OpenGraph URLs (in the assets_dev.csv CSV file) to the development and production Firestore database.\nUpdate the server .env file with the production Firebase variables: FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY.\nRun the server NPM script:\nnpm run seed:11_assets\nUpdate the server .env file with the development Firebase variables: FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY.\nRe-run the NPM script on step #2.\nDeploy to the production environment (after deploying first to the development environment since this is part of the deployment process) to view the updates on the live production site.","confirm-the-new-opengraph-images#Confirm the New OpenGraph Images":"Load the production website on a browser tab after successfully deploying to the production environment on the Upload the New OpenGraph URLs - step #5.\nInspect the web page elements by right-clicking on the page and then selecting the Inspect option.\nLook for the <meta> property property=\"og:image\" under the <head> tag. Its content attribute should contain the OpenGraph image URL encoded in the assets_dev.csv CSV file. For example:\n<meta property=\"og:image\" content=\"https://firebasestorage.googleapis.com/v0/b/amia-cis-dev.appspot.com/o/media%2Fimages%2Fopengraph%2F1200x600%2Fog_home_1200.png?alt=media&token=51f9241c-45da-456e-9906-677c2f8fe93a\">\nShare one of the public web pages in social media, for example, in a Meta (Facebook) post. Observe if the new Opengraph thumbnails are visible.\nNew OpenGraph thumbnails may take some time to display the latest pictures from some image hosting providers, such as Firebase Storage, depending on its server settings for maxAge in seconds, even if its new OpenGrapgh image URL is already visible in the <meta> tag from step #3."}},"/post-installation/pdf":{"title":"PDF Bulletins","data":{"":"ACAP's bulletin PDFs use hard-coded Bicol-related text in their headers and footers to allow flexible manual layout adjustments. These static elements should be updated with text relevant to the new region.\nThis section covers how to update the static text content within the PDF bulletin layouts. To edit or create new PDF layouts, refer to the PDF Development layout guide.","edit-the-logos#Edit the Logos":"Replace the Region 5 logos with new region-related logos in these directories:\n/server/src/utils/pdf/livereload/public/common/images\n/server/src/utils/pdf/livereload/public/tenday/images\n/server/src/utils/pdf/livereload/public/special-signal/images","seasonal-bulletin-pdf#Seasonal Bulletin PDF":"","edit-the-seasonal-html-file#Edit the Seasonal HTML File":"Open the seasonal PDF's HTML layout:/server/src/utils/pdf/livereload/public/seasonal/index.html\nReplace Region 5's header text with new region text.\nREGIONAL FIELD OFFICE NO. 5\r\nSan Agustin, Pili, Camarines Sur, 4418\r\nhttp://bicol.da.gov.ph\nReplace Region 5's footer text with new region text.\nDEPARTMENT OF AGRICULTURE SUPPORTS\r\n- Pre-positioned planting materials and other farm inputs\r\n- Research station available for livestock evacuations\r\n- Availability of ropes, power sprayer, mist blowers, laminated sacks and  water drums\r\n- Drugs and biologics for livestocks\r\n- Farm machineries stationed in the DA RFO 5 and Research Outreach Station in every province\r\n- Technical assistance for farm operations\r\n- Climate Information services","edit-the-seasonal-ejs-file#Edit the Seasonal EJS File":"Open the seasonal PDF's EJS layout file in  /server/src/utils/pdf/livereload/templates/pdf-seasonal.ejs\nApply the header and footer text updates similar with Edit the Seasonal HTML File steps #2 and #3 in this file.","10-day-bulletin-pdf#10-Day Bulletin PDF":"","edit-the-10-day-html-file#Edit the 10-day HTML File":"Open the 10-day PDF's HTML layout:/server/src/utils/pdf/livereload/public/tenday/index.html\nReplace Region 5's header text with new region text.\nREGIONAL FIELD OFFICE NO. 5\r\nSan Agustin, Pili, Camarines Sur, 4418\r\nhttp://bicol.da.gov.ph\nReplace Region 5's footer text with new region text.\nDEPARTMENT OF AGRICULTURE SUPPORTS\r\n- Pre-positioned planting materials and other farm inputs\r\n- Research station available for livestock evacuations\r\n- Availability of ropes, power sprayer, mist blowers, laminated sacks and  water drums\r\n- Drugs and biologics for livestocks\r\n- Farm machineries stationed in the DA RFO 5 and Research Outreach  Station in every province\r\n- Technical assistance for farm operations\r\n- Climate Information services","edit-the-10-day-ejs-file#Edit the 10-day EJS File":"Open the 10-day PDF's EJS layout file in  /server/src/utils/pdf/livereload/templates/pdf-tenday.ejs\nApply the header and footer text updates similar with Edit the 10-day HTML File steps #2 and #3 in this file.","special-weather-bulletin-pdf#Special Weather Bulletin PDF":"","edit-the-special-html-file#Edit the Special HTML File":"Open the special weather PDF's HTML layout:/server/src/utils/pdf/livereload/public/special-signal/index.html\nReplace Region 5's header text with new region text.\nREGIONAL FIELD OFFICE NO. 5\r\nSan Agustin, Pili, Camarines Sur, 4418\r\nhttp://bicol.da.gov.ph\nReplace Region 5's footer text with new region text.\nDEPARTMENT OF AGRICULTURE SUPPORTS\r\n- Pre-positioned planting materials and other farm inputs\r\n- Research station available for livestock evacuations\r\n- Availability of ropes, power sprayer, mist blowers, laminated sacks and  water drums\r\n- Drugs and biologics for livestocks\r\n- Farm machineries stationed in the DA RFO 5 and Research Outreach Station in every province\r\n- Technical assistance for farm operations\r\n- Climate Information services","edit-the-special-ejs-file#Edit the Special EJS File":"Open the special weather PDF's EJS layout file in  /server/src/utils/pdf/livereload/templates/pdf-special-signal.ejs\nApply the header and footer text updates similar with Edit the Special Weather HTML File steps #2 and #3 in this file."}},"/post-installation/recommendations":{"title":"Recommendations Dataset","data":{"":"This section describes methods for uploading ACAP's recommendations dataset to the database, which it uses for generating public crop recommendations or bulletin PDFs.It details guides on uploading ACAP's recommendations dataset for the latest ACAP 2.0 version. It also discusses upload methods for the older ACAP 1.0 recommendations for backtracking purposes."}},"/post-installation/recommendations/recommendations-v1":{"title":"ACAP 1.0 Crop Recommendations","data":{"introduction#Introduction":"ACAP 1.0 uses NPM scripts to parse, validate, and upload recommendations data from a local Excel file. Similar to the ACAP 1.0 cropping calendar data, only developers can upload recommendations by running the NPM script on a terminal.\nThis section describes methods for uploading the local recommendations dataset for the older ACAP 1.0. Its last stable version is Release/Tag version 9.5.6, accessible in the climate-services-webportal-v1 and acap-v2 code repositories.Follow this link to view recommendations dataset upload instructions for the latest ACAP 2.0.","data-format#Data Format":"ACAP 1.0 requires initial recommendations data in an Excel file, following the format and structure defined in the /server/src/scripts/data/recommendations_html_acap_bicol.xlsx or the mock_recommendations_html_v2.xlsx samples. This Excel file has tabs containing formatted recommendations data, with crop stages and weather forecast rainfall conditions, for the seasonal, 10-day, and severe cyclone weather crop recommendations.\nThe crop stage codes in the Excel columns should match the crop stage codes defined in the ACAP 1.0 cropping calendar raw CSV file to ensure the correct association of crop stages with target recommendations.","upload-recommendations#Upload Recommendations":"ACAP 1.0 uploads its recommendations dataset to the Firestore database using NPM scripts, accessible only to developers.","prepare-recommendations-data#Prepare recommendations data":"Prepare the recommendations dataset in an Excel file similar to the recommendations samples described in the Data Format section.\nPut the EXCEL file in the /server/src/scripts/uploaders/recommendations directory.","use-a-target-environment#Use a target environment":"Open the server .env file. Update the FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY keys with the development or production key values.","run-the-npm-script#Run the NPM Script":"Navigate to the /server directory from a terminal.\nRun the command, replacing recommendations_html_acap_bicol.xlsx with the filename of a recommendations EXCEL file:\nnpm run upload:recommendations --localfilename=recommendations_html_acap_bicol.xlsx\nEnsure running the script from step #3 is completed successfully."}},"/post-installation/recommendations/recommendations-v2":{"title":"ACAP 2.0 Crop Recommendations","data":{"introduction#Introduction":"This section describes methods for uploading the ACAP 2.0 recommendations dataset, whose latest stable version is Release/Tag version , accessible in the acap-v2 repository.Follow this link to view upload instructions for the older ACAP 1.0 recommendations dataset.","data-format#Data Format":"ACAP 2.0 uses recommendations data similar to the ACAP 1.0 raw data, added with climate risk information and exclusion of several Excel columns. View its raw EXCEL data files in the /server/src/scripts/data/dataset_v2.0 directory to gain insight into its new contents and data structure.The samples only display the ACAP 2.0 recommendations dataset for the Rice and Corn crops.\nThe crop stage codes should match the crop stage codes defined in the ACAP 2.0 cropping calendar raw CSV files specific to target crops to ensure the correct association of crop stages with target recommendations.\nSupport for Multiple Crops \r\nDevelopers can add crop stages and labels for other crops, following the crop stages code and label format in the /client/src/utils/constants.js file and by creating recommendations datasets for other crops similar to the sample recommendations Excel files described in the Data Format section as a reference.","upload-recommendations#Upload Recommendations":"ACAP 2.0 uploads its recommendations dataset using an upload form on the Manage Recommendations page, requiring Admin login.\nThe crop stage codes should match the crop stage codes defined in the crop recommendations raw Excel files specific to target crops to ensure the correct association of crop stages with target recommendations.","prepare-the-frontend--backend#Prepare the frontend / backend":"Update the frontend and backend codes with necessary data for supporting other crops, with data formats described in the Data Format section.","login-as-admin#Login as Admin":"Login as an ACAP admin, then, navigate to the Recommendations Management page in the /admin/manage-recommendations route.","upload-recommendations-1#Upload Recommendations":"Upload Recommendations: Select a \"Crop Type\" from the available crops list and select options.\nUpload an Excel file: Press the SEARCH icon.\nBrowse for a recommendations Excel dataset that corresponds to the selected Crop Type in step #1.\nPress the UPLOAD button.\nWait for the upload success or fail status response to appear."}},"/post-installation/weather-forecasts":{"title":"PAGASA Weather Forecasts","data":{"":"This section expands on the Installation guide, detailing the setup steps for updating ACAP's Seasonal, 10-Day, and Special (Severe Cyclone) weather forecast data from the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA).\nThese steps are dependent on the first-time successful initialization and setup from the Installation section."}},"/post-installation/weather-forecasts/seasonal-forecast":{"title":"PAGASA Seasonal Weather Forecast","data":{"introduction#Introduction":"After achieving a successful initialization from following the steps in the Installation section, developers will notice a blank, default Seasonal weather forecast table in the public ACAP Services → Seasonal Forecast page.Follow these steps to update it with the latest PAGASA seasonal weather forecast data.","pagasa-seasonal-weather-forecast-excel-file#PAGASA Seasonal Weather Forecast Excel File":"ACAP Bicol, having a Memorandum of Agreement (MOA) with PAGASA, regularly receives PASAGSA seasonal weather forecast data in Excel file format through email. ACAP Bicol Admins upload these to the portal to update the seasonal weather forecast data.\nFor consistency, ACAP's seasonal weather forecast processing scripts expect an Excel data format similar to the \"/server/src/scripts/data/pagasa_seasonal_v2.xlsx\" Excel file. PAGASA shared this file for Bicol's November 2022 - April 2023 seasonal weather forecast.\nFor reference, the data in the seasonal weather forecast Excel file is also available in JPEG/picture format at the PAGASA Seasonal Forecast web page at https://www.pagasa.dost.gov.ph/climate/climate-prediction/seasonal-forecast under the Forecast Rainfall Analysis section.","update-the-seasonal-weather-forecast#Update the Seasonal Weather Forecast":"","obtain-seasonal-weather-forecast-data#Obtain Seasonal Weather Forecast Data":"Obtain the latest PAGASA seasonal weather forecast Excel file.Developers (or Admins) can use the default seasonal weather forecast Excel file described in the PAGASA Seasonal Weather Forecast Excel File, using values for their respective region, if the PAGASA-shared seasonal weather forecast Excel file is not readily available.","upload-the-seasonal-weather-forecast-excel-file#Upload the Seasonal Weather Forecast Excel File":"Sign in as an ACAP Admin, then go to the ACAP Settings → SEASONAL tab. This page is accessible in the localhost route:\nhttps://localhost:3000/admin/weather/\nPress the SEARCH icon button under the Upload an Excel file label. Look for and select the target PAGASA seasonal weather forecast Excel file from the local hard drive.\nFill in the input values under the Tropical Cyclone Input section. Refer to the seasonal Excel file's 3rd tab, which contains pictures of the expected number of tropical cyclones in JPEG/picture format to populate these values. This step is required to upload the Excel file on step #4.\nPress the UPLOAD button beside the SEARCH icon to upload the Excel file. A successful upload should update the default seasonal weather forecast data with new data defined in the Excel file.","update-weather-systems-data#Update Weather Systems Data":"Add, edit or delete items under the Weather Systems that May Affect the Region section in the ACAP Settings → SEASONAL tab.","el-nino--la-nina-data#El Nino / La Nina Data":"ACAP displays El Nino / La Nina information with data sourced from the PAGASA El Niño / La Niña Monitoring web page at https://www.pagasa.dost.gov.ph/climate/el-nino-la-nina/monitoring.It updates the data using a cron job, running in a GitHub Actions Scheduled Workflow every Sunday.\nManual mechanisms for triggering the update are currently not available.","acap-rest-api#ACAP REST API":"Seasonal weather forecast data is available in the REST API endpoints (plus other query parameters) if the ACAP-RCMAS REST APIs are active:\nCurrent data: GET /api/weatherforecast?type=seasonal\nHistorical data: GET /api/weatherforecast/archives?type=seasonal","tools#Tools":"","pagasaexcel#pagasaexcel":"A Node Package Manager (NPM) script that parses, validates, extracts, and formats data from the PAGASA seasonal Excel file (\"pagasa_seasonal_v2.xlsx\") into a JavaScript object, ready for upload to the Firestore database.\nAvailable in the /server/src/scripts/pagasaexcel directory.","recommendations#Recommendations":"PAGASA has discussed creating a REST API for sharing weather forecast data. ACAP should integrate with this API after becoming available as an upgrade to its semi-automatic method of uploading PAGASA-shared seasonal weather forecast Excel files."}},"/post-installation/weather-forecasts/special-forecast":{"title":"PAGASA Special (Severe Cyclone) Weather Forecast","data":{"introduction#Introduction":"ACAP displays tropical cyclone data sourced from PAGASA's Tropical Cyclone Bulletin web page at https://www.pagasa.dost.gov.ph/tropical-cyclone/severe-weather-bulletin.\nIt regularly syncs with data from the PAGASA web page using a cron job that runs every two (2) hours in a GitHub Actions Scheduled Workflow, following a successful initialization and deployment setup.","manual-update#Manual Update":"These steps describe running the cron script to trigger a manual update to ACAP's Special (Severe Cyclone) Weather Forecast data.","use-a-target-environment#Use a target environment":"Open the server .env file. Update the FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY keys with the development or production key values.","run-the-npm-script#Run the NPM Script":"Navigate to the /server directory from a terminal.\nRun the command:\nnpm run cron:cyclone","re-run-on-github-actions#Re-run on GitHub Actions":"This method is an alternate option for running the NPM script aside from step #2, available after confirming a successful setup and deployment of the GitHub Actions cron jobs.\nGo to the forked repository's Actions tab.\nSelect the CRON Scrape and Update Cyclone Information workflow in the left-side menu.\nSelect and click one of the latest successful workflow runs.\nPress the button on the upper right with the label \"Re-run all jobs.\"","trigger-update-in-acap-settings#Trigger Update in ACAP Settings":"Sign in as an Admin to the ACAP website.\nGo to the ACAP Settings → TROPICAL CYCLONE tab.\nPress the SYNC button.\nWait for the update success or fail status response to appear. A successful trigger will display an updated \"Date synced\" field in the Current Data Update Summary section, displaying the latest time and date of the successful update.","acap-rest-api#ACAP REST API":"Special weather forecast data is available in the REST API endpoints (plus other query parameters) if the ACAP-RCMAS REST APIs are active:\nCurrent data: GET /api/weatherforecast?type=special\nHistorical data: GET /api/weatherforecast/archives?type=special","recommendations#Recommendations":"Since the special weather forecast updater runs in an NPM script, options are available for running it in OS-native cron or task schedulers as an alternative to using GitHub Actions Scheduled Workflow."}},"/post-installation/weather-forecasts/tenday-forecast":{"title":"PAGASA 10-Day Weather Forecast","data":{"introduction#Introduction":"ACAP sources its 10-day weather forecast data from PAGASA's public 10-day weather forecast data (available as Excel files from day 1 - day 10) their 10 Day Climate Forecast web page at https://www.pagasa.dost.gov.ph/climate/climate-prediction/10-day-climate-forecast.This section describes updating the initial 10-day weather forecast data with the latest values.\nACAP's initialization steps from the Installation and Setup section use an older set of 10-day weather forecast data for demonstration.\nAfter confirming successful initialization and deployment setup, ACAP's cron script, running in a GitHub Actions Scheduled Workflow, will regularly sync with the latest posted PAGASA 10-data weather forecast daily once between 9:30 AM - 12:00 PM.","update-steps#Update Steps":"","use-a-target-environment#Use a target environment":"Open the server .env file. Update the FIREBASE_SERVICE_ACC and FIREBASE_PRIVATE_KEY keys with the development or production key values.","run-the-npm-script#Run the NPM Script":"Navigate to the /server directory from a terminal.\nRun the command:\nnpm run cron:tenday","re-run-on-github-actions#Re-run on GitHub Actions":"This method is an alternate option for running the NPM script aside from step #2, available after confirming a successful setup and deployment of the GitHub Actions cron jobs.\nGo to the forked repository's Actions tab.\nSelect the CRON Download, Parse and Upload Excel Files workflow in the left-side menu.\nSelect and click one of the latest successful workflow runs.\nPress the button on the upper right with the label \"Re-run all jobs.\"","manual-data-upload#Manual Data Upload":"Sign in as an Admin to the ACAP website.\nGo to the ACAP Settings → 10-DAY tab.\nFollow the instructions for manually updating the 10-day weather forecast data. It involves:\nDownload the day 1 - day 10 PAGASA 10-day weather forecast Excel files from PASAGA's 10-Day Climate Forecast web page to the local PC or laptop.\nUpload all ten (10) of the Excel files using the ACAP Settings → 10-DAY upload form.\nPress the SUBMIT button after selecting the Excel files from step #3.\nWait for the update success or fail status response to appear. A successful trigger will display an updated \"Date synced\" field in the Current Data Update Summary section, displaying the latest time and date of the successful update.","acap-rest-api#ACAP REST API":"10-day weather forecast data is available in the REST API endpoints (plus other query parameters) if the ACAP-RCMAS REST APIs are active:\nCurrent data: GET /api/weatherforecast?type=tenday\nHistorical data: GET /api/weatherforecast/archives?type=tenday","recommendations#Recommendations":"Since the 10-day weather forecast updater runs in an NPM script, options are available for running it in OS-native cron or task schedulers as an alternative to using GitHub Actions Scheduled Workflow."}},"/post-installation/webmap":{"title":"Web Map on Home Page","data":{"":"This section covers how to update the GeoJSON map boundaries on the Home Page (the colored province overlays).This step is labelled (Optional) because the SHAPEFILE and new AMIA Villages data for the target region may yet not be readily available during Installation.","required-files#Required Files":"These steps require the files:\nSHAPEFILE (.shp, .shx, .prj, .dbf and .cpg files) of the new region\nNew AMIA Villages information of the new region in a CSV file, following the format in the\r\n/server/src/scripts/data/amia_villages_r5.csv file.\nSince ACAP uses the provinces and municipality naming conventions from the PAGASA 10-day weather forecast Excel file, please ensure the SHAPEFILE and AMIA Villages CSV file share similar naming conventions with it.","normalize-the-shapefile#Normalize the SHAPEFILE":"Convert the SHAPEFILE to a normalized, web-friendly GeoJSON file format. (Recommended GeoJSON file size is approximately less than 500KB).\n(Optional) Use QGIS to check the SHAPEFILE for errors. Follow steps No. 2, No. 3 and No. 4 described in the URL link to check and fix SHAPEFILE errors.\r\nhttps://github.com/ciatph/ciatph.github.io/issues/33#issuecomment-769405843\n(Optional) Use the https://github.com/ciatph/shapefile-simplify tool to normalize, simplify and convert the SHAPEFILE to GeoJSON, playing around with PERCENTAGE % values that lead to a small file size with acceptable visual effects when loaded on the Home page.ACAP 1.0's GeoJSON file is available in /server/src/scripts/data/geojson/acap-bicol.geojson file for reference.","upload-the-geojson-file#Upload the GeoJSON file":"","mapbox-hosting#MapBox Hosting":"Upload the normalized GeoJSON file to MapBox, or any hosting service that allows serving GeoJSON content over HTTP from Normalize the SHAPEFILE step #2 or #3. The original ACAP 1.0 uses MapBox (Datasets) for hosting.Update the following variables when using MapBox:\nMAPBOX_BASEMAP_STYLE_ID\r\nMAPBOX_DATASET_ID\r\nMAPBOX_API_KEY","firebase-storage-hosting#Firebase Storage Hosting":"You can use Firebase Storage in case a new MapBox account is not readily available.Replace the NEXT_PUBLIC_GEOJSON_URL variable with the GeoJSON file's remote URL after uploading it to Firebase Storage.","upload-the-amia-villages-data#Upload the AMIA Villages Data":"Upload the new AMIA Villages information (CSV file) to Firestore.\nCopy the new CSV file to /server/src/scripts/data/amia_villages_r5.csv\nRun the server NPM script:\nnpm run seed:01_amiavillages\nRe-deploy to the development and production environments to view the updates on the live sites."}},"/references":{"title":"References","data":{"":"This section contains URL links to partners and various online references used by ACAP for development.","partners-and-resources#Partners and Resources":"Department of Agriculture (DA)\nDepartment of Agriculture - Bicol Region (DA RFO 5)\nUniversity of the Philippines Los Baños Foundation Incorporated (UPLBFI)\nAlliance Bioversity & CIAT\nDOST-PAGASA\nAMIA CIAT Demo","frontend#Frontend":"NextJS\nMaterial UI\nGitHub Pages\nFirebase Hosting","backend#Backend":"NodeJS\nFirebase Admin SDK\nRender\nVercel","firebase-authentication#Firebase Authentication":"Firebase Authentication\nFirebase Custom Claims\nFirebase Admin SDK","database#Database":"Firestore Web API\nFirestore REST APIs\nFirestore Rules","online-storage#Online Storage":"Firebase Storage Web APIs","miscellaneous#Miscellaneous":"Assets Used for this Site\nCustom CMS"}},"/requirements":{"title":"Requirements","data":{"":"This post describes the dependencies and requirements needed to run run ACAP 1.0 (ACAP-Bicol) on a PC or laptop for local development.","development-machine#Development Machine":"Windows/Mac PC or laptop\n@least 8GB RAM or higher","software-installed#Software Installed":"Visual Studio Code (VSCode) IDE\nversion: v1.79.2 (any version that can run NodeJS)\nnvm\nnvm is optional, if you can install NodeJS LTS version 16.14.2 on item #3\nFor Windows OS\nInstall with nvm-windows\nversion 1.1.12\nFor other OS\nPlease refer to guides for installing nvm for your PC or laptop\nNodeJS LTS version 16.14.2\n(preferrably installed using nvm)\nnode version: 16.14.2\nnpm version: 8.5.0\nYarn version 1.22.19\n(installed using npm)\nGit Terminal\nFor Windows OS: GitBash\nFor non-Windows OS: (Please refer to the recommended git terminal installation methods for your OS)","programming-languagesservices#Programming Languages/Services":"React\nNodeJS\nJavaScript\nGitHub\nFirebase\nFirebase for Web\nFirebase for NodeJS (Firebase Admin)\nFirebase Services\nAuthentication\nFirestore\nStorage","cloud-service-accounts-standard-pricing#Cloud Service Accounts (standard pricing)":"GitHub (2)\nhttps://github.com\nRender (2)\nhttps://render.com\nFirebase (1) account\nhttps://firebase.google.com\nSemaphore\nhttps://semaphore.co","docker#Docker":"ACAP promotes using NodeJS to run on localhost development. Using Docker is optional, since it has Dockerfiles configured for local development and production deployment.Users are expected to have experience managing installing and setting-up Docker, if they are going to use it for development or production deployment.","microsoft-windows-1011#Microsoft Windows 10/11":"Docker Desktop\nDocker Compose version v2.27.1-desktop.1\nDocker Engine version 26.1.4, build 5650f9b","ubuntu-22041#Ubuntu 22.04.1":"Docker version 23.0.1, build a5eeb1\nDocker Compose v2.16.0"}},"/security":{"title":"Security Guidelines","data":{"":"ACAP adheres to strict security practices as defined by its technology stack, starting from its initial 1.0 version. When extending ACAP to add or enhance features, please ensure continued compliance with these security standards.\nNOTE: Further enhancements and feature updates to the initial ACAP 1.0 version may introduce new requirements to address additional use cases. Please ensure that security measures meet the expectations outlined in these new requirements.","database#Database":"Manually test and ensure using the Firestore Web API and Firestore REST APIs that:\n(a) Signed-in users cannot perform CREATE/EDIT/DELETE operations in the Firestore collections and documents defined in the Firestore Rules.\nNOTE: If there is a need to perform CREATE/EDIT/DELETE operations \"directly\" in the Firestore collections or documents using the Firestore Web API or Firestore REST APIs, please ensure the creation and testing of robust, new Firestore Rules that will meet the \"new\" requirements (ACAP 1.0 only performs such operations thru the backend NodeJS REST APIs, Database #2, Database #3). This ensures manageable security and safety, preventing security breaches like the cross-site scripting (XSS) attack example detailed here.\n(b) Signed-in users cannot CREATE new Firestore collections and documents\n(c) Public users without sign-in authentication cannot VIEW sensitive information such as phonebook contacts and email information\nEnsure that all mutative \"WRITE\" operations in the Firestore database occur only through authenticated HTTPS requests in the backend (NodeJS) REST APIs. (see also Server for more information).\n(a) ACAP 1.0's Firestore Rules strictly prohibits Database #1.a and Database #1.b to enforce this.\n(b) If new requirements allow item Database #1.a to \"directly\" perform CREATE/EDIT/DELETE operations in Firestore collections or documents using the Firestore Web API or Firestore REST APIs, please ensure that \"new\" and robust Firestore Rules are created and thoroughly tested. These Rules may need to be separate from ACAP 1.0, which \"discourages this approach unless Firestore Rules can be properly enforced\".\nEnsure proper server-side validation when mutating data through the backend (NodeJS) REST APIs using validation scripts in middleware or the controller scripts.\nFirestore database security relies on properly tested Firestore Rules to ensure security, especially if its rules do not disable all VIEW/CREATE/EDIT/DELETE operations.\nPlease ensure that \"new\" and robust Firestore Rules are created and thoroughly tested, in case new database components or requirements need to be added to the ACAP 1.0 Firestore database.","sensitive-data-management#Sensitive data management":"Ensure that sensitive data and environment variables are never statically generated and deployed to the GitHub Pages or Firebase Hosting static hosting websites.\nSensitive data, secured with Firebase Authentication, Firebase Custom Claims (User/Admin Accounts #1, #2) and Firestore Rules (Database #1.c) is dynamically fetched from the Firestore Database using the Firestore Web APIs or the secure (NodeJS) REST APIs.","file-storage#File Storage":"Manually test and ensure, using the Firebase Storage Web APIs, that:\nPublic and signed-in users can only \"READ\" or download the PDF bulletin files.\nPublic and signed-in users cannot UPLOAD or DELETE files.","code-base#Code base":"Ensure that the forked climate-services-webportal-v1 (ACAP 1.0) or acap-v2 (ACAP 2.0) monorepo code base remains PRIVATE in GitHub.","useradmin-accounts#User/Admin Accounts":"Ensure that Admin accounts are created by the superadmin in the NodeJS backend using Firebase Authentication with Firebase Custom Claims, leveraging the Firebase Admin SDK to ensure maximum security.\nMore information about ACAP 1.0's Security requirements are available in its Software Requirements Specifications document available in this link (accessible only for developers with access).","references#References":"","firebase-authentication#Firebase Authentication":"Firebase Authentication [link]\nFirebase Custom Claims [link]\nFirebase Admin SDK [link]","database-1#Database":"Firestore Web API [link]\nFirestore REST APIs [link]\nFirestore Rules [link]","online-storage#Online Storage":"Firebase Storage Web APIs [link]"}},"/showcase":{"title":"Showcase","data":{"":"(content for this section is under construction)"}},"/troubleshooting":{"title":"Troubleshooting","data":{"":"(docs for this section is under construction)"}},"/video":{"title":"ACAP Video Tutorials","data":{"introduction#Introduction":"This wiki discusses the development and cloud deployment approaches and strategies used with ACAP 1.0 (ACAP-Bicol). This page aims to serve as a go-to reference for demonstrating technical methods in videos under the Playlist section and to provide general guidelines and recommended approaches to interact with the ACAP 1.0 source codes.","tutorials#Tutorials":"ACAP Development Docs","playlist#Playlist":"(Please turn on the CC captions/subtitles and set the playback speed to 2x when watching the videos.)\nhttps://youtube.com/playlist?list=PLk51OcRoDPHbXE_iVwmG_UwmsYwNOPoEP","checklist#Checklist":"Initial ACAP 1.0 Duplication Checklist","requirements#Requirements":"Development Requirements","how-to-proceed#How to Proceed":"Quickly view and skim thru the videos under the Playlist section to get a quick grasp and summary of how ACAP-Bicol is initialized for local development to online (live) deployment.\nInitialize ACAP for your target region for localhost development by going thru the ACAP 1.0 Duplication for New Regions Running on Localhost (Development) Tutorial.\nAt this point, you may want to refer to the online video tutorials for more detailed demonstration on several topics related for ACAP's localhost development:\n06 Initialize the Source Code Repository - Part 1/2\n07 Initialize Firebase (Firestore, Storage, Authentication)\n08 Server setup for localhost development (Testing on Region 7)\n09 Client setup for localhost development (Testing on Region 7)\nRun your client + server ACAP on localhost. Visit and check Initial ACAP 1.0 Duplication Checklist to see if your ACAP initialization fits with success several success metrics for localhost development\nOnline deployment is next after finishing and wrapping up running ACAP on localhost.\nOnline deployment is quite flexible and you may use new methods, techniques and services which you may be more familiar with.\nYou may also follow ACAP's methods for these areas, which are described and demonstrated in more detail in the tutorial videos:\n10 Deployment to Development Environment\nRender Setup - Part 1 / 3  (development)\nInitial Website Deployment to Firebase Hosting - Part 2 / 3\nUsing GitHub Actions - Part 3 / 3\n11 Deployment to Production Environment\nRender Setup - Part 1 / 2  (production)\nWebsite Deployment to GitHub Pages - Part 2 / 3\nPost-Processing from GitHub Pages - Part 3 / 3","video-list#Video List":"01 Create GitHub Account\n02 Create GitHub Repositories\n03 Create Firebase Projects\n04 Create Render Accounts\n05 Create a Semaphore Account\n06 Initialize the Source Code Repository - Part 1/2\n06 Initialize the Source Code Repository - Part 2/2\n07 Initialize Firebase (Firestore, Storage, Authentication)\n08 Server setup for localhost development (Testing on Region 7)\n09 Client setup for localhost development (Testing on Region 7)\n10 Deployment to Development Environment\nRender Setup - Part 1 / 3  (development)\nInitial Website Deployment to Firebase Hosting - Part 2 / 3\nUsing GitHub Actions - Part 3 / 3\n11 Deployment to Production Environment\nRender Setup - Part 1 / 2  (production)\nWebsite Deployment to GitHub Pages - Part 2 / 3\nPost-Processing from GitHub Pages - Part 3 / 3","demo#Demo":"These demos load the website front and backend (upon sign-in) with default Firestore data of the region we used throughout the tutorials (Region 7 provinces and municipalities). To follow updating full UI references of the \"bicol\" text in later updates.","official-production-demo#Official Production Demo":"https://region7-tutorial.github.io/","development-version-demo#Development Version Demo":"https://region7-tutorial-dev.web.app"}}}